// Program to sum 1 to N number added from console

// Input
int N = int.Parse(Console.ReadLine());
int result = 0;

// Calculation
for (int i = 1; i <= N; i++)
{
    result = result + i;
}
Console.WriteLine(result);

/*важно да се отбележи при For Loop на всяко завъртане понеже даваме i++ i в началото се увеличава с 1
 * резултата от предходното завъртане + съответното завъртане
 * тоест
 * N = 5 times:
 * завъртане 1: result = 0 + 1; при започване резултата е 0 а i = 1; за това на изхода получаваме 1
 * завъртане 2: result = 1 + 2; резултата започва с 1 а i = 2; понеже е 2-ро завъртане
 * завъртане 3: result = 3 + 3; резултата започва с 3 а i = 3; понеже е 3-то завъртане
 * завъртане 4: result = 6 + 4; резилтата започва с 6 а i = 4; понеже е 4-то завъртане
 * завъртане 5: result = 10 + 5;резултата започва с 10 а i= 5; понеже е 5-то завъртане
 * и по този начин краиния result = 15
 */