string name = Console.ReadLine();
Console.WriteLine("Hello, " + name +"!");


// за да поставя празен ред в конзолата трябва да напиша празна команда Console.WriteLine();
// ВАЖНО да следя многократно точните запетайки и удивителни които се иска в задачата да се запишат!!!!

/* Модулно деление означава се с % как се смята пример:
 * имаме модулно деление 9 % 2 вземаме второто число в случая 2 и питаме колко пъти може второто число
 * да се впише в първото число тоест 2+2+2+2=4пъти можем да се впишем в 9 при 5-тия път ще получим по-високо число
 * след което второто число което имаме се умножава по числото което сме получили тоест 4*2=8 и накрая
 * първото число от главното уравнение го изваждаме от полученото число от сметките тоест 9-8= 1 или това 
 * нашето модулно число
 * 
 * тези модулни числа най-често се използват за да се определи дали дадено число е
 * even или odd четно или нечетно: пример
 * 
 * double a = 9;
 * double b = 2;
 * Console.WriteLine(a % b);
 * */
